<h2>Parte 1</h2>

<h3>Ejemplo de muestreo aleatorio en Pandas</h3>

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:

# Obtener una muestra aleatoria de 10 filas
df_muestra = df.sample(n=10, random_state=42)
df_muestra

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
709,710,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C
439,440,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C
290,291,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.8500,NaN,S
300,301,1,3,"Kelly, Miss. Anna Katherine ""Annie Kate""",female,NaN,0,0,9234,7.7500,NaN,Q
333,334,0,3,"Vander Planke, Mr. Leo Edmondus",male,16.0,2,0,345764,18.0000,NaN,S
208,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.0,0,2,11752,26.2833,D47,S

<h3>Permutación aleatoria de datos</h3>

In [11]:
# Reordenar aleatoriamente todas las filas
df_permutado = df.sample(frac=1, random_state=42)
df_permutado.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
709,710,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C
439,440,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C

<h3>Ejemplo de ordenamiento por una columna</h3>

In [12]:
# Ordenar por la columna 'PassengerId' de forma ascendente
df_ordenado = df.sort_values(by='PassengerId', ascending=True)
df_ordenado.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<h3>Ordenamiento por múltiples columnas</h3>

In [12]:
# Ordenar primero por 'PassengerId' (ascendente) y luego por 'Pclass' (descendente)
df_ordenado = df.sort_values(by=['PassengerId', 'Pclass'], ascending=[True, False])
df_ordenado.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<h3>Ejemplo de detección de duplicados</h3>

In [13]:
# Identificar registros duplicados
duplicados = df.duplicated()
duplicados.sum()  # Número de registros duplicados

np.int64(0)

<h3>Eliminación de duplicados</h3>

In [14]:
# Eliminar registros duplicados
df_sin_duplicados = df.drop_duplicates()
df_sin_duplicados.shape

(891, 12)

<h3>Ejemplo de reemplazo de valores</h3>

In [14]:
# Crear un DataFrame con valores erróneos
df = pd.DataFrame({'Producto': ['Laptop', 'Tablet', 'Celular', 'Lapto', 'Tablet'],
                   'Precio': [1000, 500, 800, 950, 520]})

In [15]:
# Reemplazar valores incorrectos
df['Producto'] = df['Producto'].replace({'Lapto': 'Laptop'})
df

  Producto  Precio
0   Laptop    1000
1   Tablet     500
2  Celular     800
3   Laptop     950
4   Tablet     520

<h3>Reemplazo con expresiones regulares</h3>

In [16]:
# Reemplazar valores que contengan un patrón específico
df['Producto'] = df['Producto'].str.replace(r'Lapto', 'Laptop', regex=True)

<h3>Ejemplo de binning en Pandas</h3>

In [20]:
# Crear un DataFrame con datos continuos
df = pd.DataFrame({'Edad': [22, 25, 30, 35, 40, 45, 50, 55, 60]})

# Definir los rangos (bins)
bins = [20, 30, 40, 50, 60]
etiquetas = ['Joven', 'Adulto Joven', 'Adulto', 'Mayor']

# Aplicar discretización
df['Grupo Edad'] = pd.cut(df['Edad'], bins=bins, labels=etiquetas)
print(df)

   Edad    Grupo Edad
0    22         Joven
1    25         Joven
2    30         Joven
3    35  Adulto Joven
4    40  Adulto Joven
5    45        Adulto
6    50        Adulto
7    55         Mayor
8    60         Mayor

<h3>Ejemplo de uso de .map() en una columna categórica</h3>

In [21]:
import pandas as pd

# Crear un DataFrame
df = pd.DataFrame({'Producto': ['Laptop', 'Tablet', 'Celular'],
                   'Categoría': ['Electrónica', 'Electrónica', 'Comunicación']})

# Crear un diccionario de mapeo
mapeo = {'Electrónica': 'Tecnología', 'Comunicación': 'Telecomunicaciones'}

# Aplicar mapeo
df['Nueva Categoría'] = df['Categoría'].map(mapeo)
df

  Producto     Categoría     Nueva Categoría
0   Laptop   Electrónica          Tecnología
1   Tablet   Electrónica          Tecnología
2  Celular  Comunicación  Telecomunicaciones

<p>.map() en Pandas se utiliza para transformar los valores de una columna (Series) basándose en una correspondencia específica</p>

<h3>Ejemplo de .apply() en múltiples columnas</h3>

In [23]:
# Crear un DataFrame
df = pd.DataFrame({'Nombre': ['Ana', 'Luis', 'Carlos'],
                   'Edad': [25, 30, 28],
                   'Salario': [50000, 54000, 58000]})

# Aplicar una función a varias columnas
def categorizar_fila(fila):
    if fila['Salario'] > 55000:
        return 'Alto'
    else:
        return 'Medio'

# Aplicar función a cada fila
df['Nivel Salarial'] = df.apply(categorizar_fila, axis=1)
df

   Nombre  Edad  Salario Nivel Salarial
0     Ana    25    50000          Medio
1    Luis    30    54000          Medio
2  Carlos    28    58000           Alto

<h3>Ejemplo de expresión lambda para calcular descuentos</h3>

In [25]:
# Crear un DataFrame
df = pd.DataFrame({'Precio': [1000, 500, 800, 1500]})

# Aplicar descuento del 10%
df['Precio con Descuento'] = df['Precio'].apply(lambda x: x * 0.90)
df

   Precio  Precio con Descuento
0    1000                 900.0
1     500                 450.0
2     800                 720.0
3    1500                1350.0

<h2>Parte 2</h2>

<h3>Ejemplo de agregar una nueva columna</h3>

In [16]:
# Crear un DataFrame
df = pd.DataFrame({'Nombre': ['Ana', 'Luis', 'Carlos'],
                   'Edad': [25, 30, 28]})

# Agregar una nueva columna
df['Ciudad'] = ['Madrid', 'Barcelona', 'Sevilla']
print(df)

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    28    Sevilla

<h3>Ejemplo de eliminar una columna</h3>

In [27]:
# Eliminar la columna 'Ciudad'
df = df.drop(columns=['Ciudad'])
print(df)

   Nombre  Edad
0     Ana    25
1    Luis    30
2  Carlos    28

<h3>Ejemplo de selección de un subconjunto de columnas</h3>

In [28]:
# Seleccionar solo las columnas 'Nombre' y 'Edad'
df_reducido = df[['Nombre', 'Edad']]
df_reducido

   Nombre  Edad
0     Ana    25
1    Luis    30
2  Carlos    28

<h3>Ejemplo de selección de filas específicas</h3>

In [30]:
# Seleccionar las primeras dos filas
df_subset = df.iloc[:2]
df_subset

  Nombre  Edad
0    Ana    25
1   Luis    30

<h3>Ejemplo de conversión de tipos</h3>

In [42]:
# Crear un DataFrame con datos en formato de texto
df = pd.DataFrame({'ID': ['1', '2', '3'], 'Precio': ['1000', '500', '800']})
df

  ID Precio
0  1   1000
1  2    500
2  3    800

In [43]:
# Convertir a tipos numéricos
df['ID'] = df['ID'].astype(int)
df['Precio'] = df['Precio'].astype(float)
df.dtypes

ID          int64
Precio    float64
dtype: object

<h3>Ejemplo de definición de índice</h3>

In [44]:
# Definir la columna 'ID' como índice
df.set_index('ID', inplace=True)
df

    Precio
ID
1   1000.0
2    500.0
3    800.0

<h3>Ejemplo de reseteo de índice</h3>

In [45]:
# Resetear el índice
df.reset_index(inplace=True)
df

   ID  Precio
0   1  1000.0
1   2   500.0
2   3   800.0

<h3>Ejemplo de renombrar columnas</h3>

In [46]:
# Renombrar columnas
df = df.rename(columns={'Precio': 'Costo'})
df

   ID   Costo
0   1  1000.0
1   2   500.0
2   3   800.0

<h3>Ejemplo de eliminación de duplicados</h3>

In [48]:
# Crear un DataFrame con datos duplicados
df = pd.DataFrame({'Nombre': ['Ana', 'Luis', 'Ana', 'Carlos'],
                   'Edad': [25, 30, 25, 28]})
df

   Nombre  Edad
0     Ana    25
1    Luis    30
2     Ana    25
3  Carlos    28

In [13]:
# Eliminar duplicados
df_sin_duplicados = df.drop_duplicates()
df_sin_duplicados

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q